src/test/resources/requests/PushEventArray.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header />
   <S:Body>
      <ns2:PushEventArray xmlns:ns2="http://rail.push.ws.nicbase.com/">
         <!--1 or more repetitions:-->
         <pushEvents>
            <assetId>4711</assetId>
            <!--Optional:-->
            <assetName>3780 4993 602-1</assetName>
            <!--1 or more repetitions:-->
            <events>
               <boxId>1111</boxId>
               <!--Optional:-->
               <eventTimestamp>2017-04-05T10:10:23.500Z</eventTimestamp>
               <eventType>DRIVE_OUT_GEOCIRCLE</eventType>
               <!--Optional:-->
               <value>Kempten1</value>
               <!--Optional:-->
               <additional />
            </events>
            <events>
               <boxId>1112</boxId>
               <!--Optional:-->
               <eventTimestamp>2017-04-06T10:10:23.500Z</eventTimestamp>
               <eventType>DRIVE_IN_GEOCIRCLE</eventType>
               <!--Optional:-->
               <value>Kempten2</value>
               <!--Optional:-->
               <additional />
            </events>
         </pushEvents>
         <pushEvents>
            <assetId>4712</assetId>
            <!--Optional:-->
            <assetName>3780 4993 602-2</assetName>
            <events>
               <boxId>1113</boxId>
               <!--Optional:-->
               <eventTimestamp>2017-04-07T10:10:23.500Z</eventTimestamp>
               <eventType>DRIVE_OUT_GEOCIRCLE</eventType>
               <!--Optional:-->
               <value>Kempten3</value>
               <!--Optional:-->
               <additional />
            </events>
         </pushEvents>
      </ns2:PushEventArray>
   </S:Body>
</S:Envelope>